$(function () {
    alert("Let Go !!!!!")
    var rate = [
        " <img src='https://cache.gmo2.sistacafe.com/images/uploads/summary/image/6288/1452589865-12485996_10153949464107216_1334732533029270255_o.jpg'style='width:300px;height:300px;'><br><br><B>ระดับ 0-20\% !!!! คุณเป็นคนรักเดียวใจเดียว เมื่อคุณได้ในสิ่งที่คุณต้องการแล้วคุณก็จะดูแลเขาอย่างดี </B>"
    ,   "<img src='https://cache.gmo2.sistacafe.com/images/uploads/summary/image/57784/original.png'style='width:300px;height:300px;'><br><br><B>ระดับ 20-40\% !!!! คงไม่มีใครกล้ายืนยันได้ว่าคุณเป็นคนไม่เจ้าชู้ คุณนี่แหละเจ้าชู้คนหนึ่งเชียวเพียงแต่ว่าไม่ทำจนออกหน้าออกตาเท่านั้นแหละ คุณไม่ชอบที่จะจีบคนนั้นคนนี้ไปเรื่อย ๆ ถ้าคุณไม่ชอบ แต่ว่าถ้าลองชอบเข้าแล้วละก็ คุณก็จะมีวิธีการร้อยแปดพันเก้าประการที่จะทำให้เขา มาเป็นคนรักของคุณและวิธีการของคุณออกจะใช้เวลาอยู่สักหน่อย เพื่อที่จะหาทางออกให้มีความเจ็บปวดน้อยที่สุด ซึ่งก็รวมทั้งตัวคุณเองด้วยนั่นแหละ</B>"
    ,   "<img src='https://pbs.twimg.com/media/CN5x9F2UsAASZQ-.jpg'style='width:300px;height:300px;'><br><br><B>ระดับ 40-60\% !!!! ไม่อยากบอกว่าคุณเป็นคนเจ้าชู้กลายๆ โดยธรรมชาติเสกสรร คุณมีความสุขจริงๆที่มีคนเอาใจใกล้ชิด จนกระทั่งมีบ่อยที่ดูเหมือนคุณจะเหยียบเรือสองแคม เพราะความที่คุณเป็นคน Sentitive มากๆกับความรู้สึกคนรักของคุณ คุณจึงพยายามที่จะรั้งๆ ความเจ้าชู้</B>"
    ,   "<img src='https://kidtam.com/wp-content/uploads/2018/01/1-87.jpg'style='width:300px;height:300px;'><br><br><B>ระดับ 60-80\% !!!!คุณเจ้าชู้หลายใจมาก สามารถชอบใครและคบหาใครได้หลาย ๆ คน พร้อม ๆ กัน</B>"
    ,   "<img src='https://love.campus-star.com/app/uploads/2015/12/7-%E0%B8%A7%E0%B8%B4%E0%B8%98%E0%B8%B5%E0%B8%AA%E0%B8%B1%E0%B8%87%E0%B9%80%E0%B8%81%E0%B8%95%E0%B8%9C%E0%B8%B9%E0%B9%89%E0%B8%8A%E0%B8%B2%E0%B8%A2%E0%B9%80%E0%B8%88%E0%B9%89%E0%B8%B2%E0%B8%8A%E0%B8%B9%E0%B9%89.jpg'style='width:300px;height:300px;'><br><br><B>ระดับ 80-100\% !!!!คุณเจ้าชู้ระดับมหากาฬเลยทีเดียว ประเดี๋ยวทำทีเป็นเพื่อนประเดี๋ยวเป็นน้องเป็นพี่ร้ายจริง ๆ เลยนะ แต่ก็อย่างว่าถึงคุณจะเจ้าชู้วายร้ายสักแค่ไหน แต่ใครต่อใครยิ่งพากันหลงใหลคุณกันแทบจะทั้งนั้นเลยเชียว เพราะคนเจ้าชู้น่ะจะมีวิธีการร้อยแปดที่จะทำให้คนนั้นรัก คนนี้หลง เรียกว่า มีศิลปะในเรื่องของความเจ้าชู้เต็มตัว ซึ่งอาจจะเป็นเพราะผ่านประสบการณ์มามาก แต่ว่าถ้าจะให้ดู คุณควรจะรู้จักวิธีสับรางรถไฟให้ดีด้วย จะได้ไม่มีปัญหาตามมาทีหลัง เพราะความเจ้าชู้เสน่ห์แรงของคุณไง</B>"
    ]; 
                         
      
   
    $("#go").click(function () {
        $("#list").empty();
        var num_random = Math.floor(Math.random() * rate.length);
        //console.log(num_random);
        $("#list").append(rate[num_random]);

      

    
});
});